import pytest
from src.module_7 import (
    m_7_3_1,
)


# === Тест для задачи 7.3.1 ===


@pytest.mark.parametrize(
    "data, expected",
    [
        ("абракадабра", {"а": 5, "б": 2, "р": 2, "к": 1, "д": 1}),
        ("ахалаймахалай", {"а": 6, "х": 2, "л": 2, "й": 2, "м": 1}),
        (
            "трахтибидох",
            {"т": 2, "р": 1, "а": 1, "х": 2, "и": 2, "б": 1, "д": 1, "о": 1},
        ),
        ("абракадабра", {"а": 5, "б": 2, "р": 2, "к": 1, "д": 1}),
        (
            "насферату ууууу",
            {"н": 1, "а": 2, "с": 1, "ф": 1, "е": 1, "р": 1, "т": 1, "у": 6, " ": 1},
        ),
        (
            "тумба юмба лимпопо",
            {
                "т": 1,
                "у": 1,
                "м": 3,
                "б": 2,
                "а": 2,
                " ": 2,
                "ю": 1,
                "л": 1,
                "и": 1,
                "п": 2,
                "о": 2,
            },
        ),
        ("сяски масяски", {"с": 4, "я": 2, "к": 2, "и": 2, " ": 1, "м": 1, "а": 1}),
    ],
)
def test_7_3_1(data, expected):
    assert m_7_3_1(data) == expected
