import pytest
from src.module_5 import m_5_4_1, m_5_4_2, m_5_4_3


# === Тест для задачи 5.4.1 ===


@pytest.mark.parametrize(
    "data, expected",
    [
        ("5 -3 7 2 -1", "Сумма камней: 10"),
        ("0", "Сумма камней: 0"),
        ("1 2 3 4 5 6 7", "Сумма камней: 28"),
        ("7 6 5 4 3 2 1", "Сумма камней: 28"),
        ("-1 -2 -10 -8 -9", "Сумма камней: -30"),
    ],
)
def test_5_4_1(data, expected):
    assert m_5_4_1(data) == expected


# === Тест для задачи 5.4.2 ===


@pytest.mark.parametrize(
    "data, expected",
    [
        ("3 -1 2 -4 6", "Сила камней: 2"),
        ("0", "Сила камней: 0"),
        ("1 2 3 -6", "Сила камней: -12"),
        ("1 2 3 4", "Сила камней: 10"),
        ("1 2 3", "Сила камней: 12"),
        ("-1 -2 -3", "Сила камней: -24"),
        ("1 1 1 1 1", "Сила камней: 10"),
        ("100 100 101", "Сила камней: 301"),
        ("-100 -100 -101", "Сила камней: -1204"),
        ("2 3 5 -10 -5 -6 5 6 7", "Сила камней: -28"),
    ],
)
def test_5_4_2(data, expected):
    assert m_5_4_2(data) == expected


# === Тест для задачи 5.4.3 ===


@pytest.mark.parametrize(
    "data, expected",
    [
        (
            "огненный 15, водяной -23, огненный -42, земной 64, водяной 81",
            "Общая сила огненный камень: -27\nОбщая сила водяной камень: 58\nОбщая сила земной камень: 64",
        ),
        (
            "огненный 15, водяной -23, огненный -42, земной 64, водяной 81, фиолетовый 0",
            "Общая сила огненный камень: -27\nОбщая сила водяной камень: 58\nОбщая сила земной камень: 64\nОбщая сила фиолетовый камень: 0",
        ),
        (
            "ф 1, ф 5, м 10",
            "Общая сила ф камень: 6\nОбщая сила м камень: 10",
        ),
        (
            "ф 9",
            "Общая сила ф камень: 9",
        ),
    ],
)
def test_5_4_3(data, expected):
    assert m_5_4_3(data) == expected
